In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/RelativeHumidity/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [4]:
df = pd.read_excel(PATH + titles[0])

In [6]:
df

      Parámetro       Fecha  valor Unidad
0           NaN         NaN    NaN    NaN
1            HR  2018-03-02   58.0      %
2            HR  2018-03-02   62.0      %
3            HR  2018-03-02   64.0      %
4            HR  2018-03-02   67.0      %
...         ...         ...    ...    ...
17313        HR  2020-03-02   29.0      %
17314        HR  2020-03-02   30.0      %
17315        HR  2020-03-02   33.0      %
17316        HR  2020-03-02   37.0      %
17317        HR  2020-03-02   40.0      %

[17318 rows x 4 columns]

Dropping empty instances

In [8]:
df.dropna(how='all', inplace=True)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17317 entries, 1 to 17317
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  17317 non-null  object
 1   Fecha      17317 non-null  object
 2   valor      17317 non-null  float64
 3   Unidad     17317 non-null  object
dtypes: float64(1), object(3)
memory usage: 676.4+ KB

Creating the complete dataset

In [10]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [11]:
df

     Parámetro       Fecha  valor Unidad
1           HR  2018-03-02   58.0      %
2           HR  2018-03-02   62.0      %
3           HR  2018-03-02   64.0      %
4           HR  2018-03-02   67.0      %
5           HR  2018-03-02   69.0      %
...        ...         ...    ...    ...
7547        HR  2025-03-09   13.0      %
7548        HR  2025-03-09    8.0      %
7549        HR  2025-03-09    7.0      %
7550        HR  2025-03-09    9.0      %
7551        HR  2025-03-09   14.0      %

[55500 rows x 4 columns]

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55500 entries, 1 to 7551
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  55500 non-null  object
 1   Fecha      55500 non-null  object
 2   valor      55500 non-null  float64
 3   Unidad     55500 non-null  object
dtypes: float64(1), object(3)
memory usage: 2.1+ MB

Dropping unnecessary columns

In [13]:
df.drop(["Parámetro", "Unidad"], axis=1, inplace=True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55500 entries, 1 to 7551
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   55500 non-null  object
 1   valor   55500 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.3+ MB

Formating dates

In [15]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [16]:
df.head()

       Fecha  valor
1 2018-03-02   58.0
2 2018-03-02   62.0
3 2018-03-02   64.0
4 2018-03-02   67.0
5 2018-03-02   69.0

Changing column names

In [17]:
df.rename(columns={"valor":"RelativeHumidity"}, inplace=True)

In [18]:
df

          Fecha  RelativeHumidity
1    2018-03-02              58.0
2    2018-03-02              62.0
3    2018-03-02              64.0
4    2018-03-02              67.0
5    2018-03-02              69.0
...         ...               ...
7547 2025-03-09              13.0
7548 2025-03-09               8.0
7549 2025-03-09               7.0
7550 2025-03-09               9.0
7551 2025-03-09              14.0

[55500 rows x 2 columns]

Grouping per day and taking in consideration the average

In [19]:
df = df.groupby("Fecha", as_index=False).mean()

In [20]:
df

          Fecha  RelativeHumidity
0    2018-03-02         48.000000
1    2018-03-03         47.625000
2    2018-03-04         50.875000
3    2018-03-05         49.458333
4    2018-03-06         44.958333
...         ...               ...
2336 2025-03-05         31.000000
2337 2025-03-06         29.666667
2338 2025-03-07         31.500000
2339 2025-03-08         33.458333
2340 2025-03-09         31.150000

[2341 rows x 2 columns]

In [21]:
df.to_csv(PATH + "RelativeHumidity.csv", index=False)